// ────────────────────────────────────────────────────────── import 📥 ───┐
import googleCalendar from "./google-calendar.jpg"
import googleSpreadsheet from "./google-spreadsheet-3.jpg"
import henkoForm from "./henko-form.jpg"
import katukaisyu from "./katukaisyu.jpg"
import levelG from "./level-g.jpg"
import lineWorks from "./line-works.jpg"
import morningAssembly from "./morning-assembly.jpg"
import kanriAdmin from "./spreadsheet-kanriAdmin-1.jpg"
import uneiPackage from "./unei-package.jpg"

// ────────────────────────────────────────────────────────────────────────┘

// ─────────────────────────────────────────────────────────── setup 🏗 ───┐
let img = {
  googleCalendar,
  googleSpreadsheet,
  henkoForm,
  katukaisyu,
  levelG,
  lineWorks,
  morningAssembly,
  kanriAdmin,
  uneiPackage,
}
// ────────────────────────────────────────────────────────────────────────┘

// ────────────────────────────────────────────────────────── export 📤 ───┐
export default img
// ────────────────────────────────────────────────────────────────────────┘