// ────────────────────────────────────────────────────────── import 📥 ───┐
import googleCalendar from "../img/google-calendar.jpg";
import googleSpreadsheet from "../img/google-spreadsheet-3.jpg";
import henkoForm from "../img/henko-form.jpg";
import katsukaisyu from "../img/katukaisyu.jpg";
import lineWorks from "../img/line-works.jpg";
import morningAssembly from "../img/morning-assembly.jpg";
import kanriAdmin from "../img/spreadsheet-kanriAdmin-1.jpg";
import uneiPackage from "../img/unei-package.jpg";
import poleStar from "../img/lacoms-pole-star.jpg";
import studentCenter from "../img/lacoms-student-center.jpg";

// ────────────────────────────────────────────────────────────────────────┘

// ─────────────────────────────────────────────────────────── setup 🏗 ───┐
let img = {
  googleCalendar,
  googleSpreadsheet,
  henkoForm,
  katsukaisyu,
  lineWorks,
  morningAssembly,
  kanriAdmin,
  uneiPackage,
  poleStar,
  studentCenter,
};
// ────────────────────────────────────────────────────────────────────────┘

// ────────────────────────────────────────────────────────── export 📤 ───┐
export default img;
// ────────────────────────────────────────────────────────────────────────┘
